# ---------------------------------------------------------------------------------  # 
#                Azure AI Searchにおいて使用するプロバイダーを明示的に指定                   #
# ---------------------------------------------------------------------------------  #

# ルートモジュールとは異なるazapiを認識してしまうため、明示的に使用するazapiを指定
terraform {
    required_providers {
        azurerm = {
            source = "hashicorp/azurerm"
            version = "~> 4.0.0"
        }
        azapi = {
            source = "azure/azapi"
            version = "~> 2.0.0"
        }
    }
}